{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "trainable": true, "inner_init": "orthogonal", "output_dim": 64, "unroll": false, "consume_less": "cpu", "init": "glorot_uniform", "dropout_U": 0.0, "input_dtype": "float32", "batch_input_shape": [null, null, 1], "input_length": null, "dropout_W": 0.0, "activation": "tanh", "stateful": false, "b_regularizer": null, "U_regularizer": null, "name": "lstm_47", "go_backwards": false, "input_dim": 1, "return_sequences": true, "W_regularizer": null, "forget_bias_init": "one"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_47"}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_48", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 64, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 128, "forget_bias_init": "one", "input_length": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_48"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_24", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}}]}